<?php

use Illuminate\Support\Facades\Schedule;

/*
|--------------------------------------------------------------------------
| Ежедневный бэкап БД и файлов (в 02:00 ночи)
|--------------------------------------------------------------------------
*/

Schedule::command('backup:clean')->daily()->at('01:30');
Schedule::command('backup:run')->daily()->at('02:00');
Schedule::command('backup:monitor')->daily()->at('03:00');

/*
|--------------------------------------------------------------------------
| Проверка здоровья бэкапов (необязательно)
|--------------------------------------------------------------------------
*/
